improver server client doc
